# main/apps.py

# Імпортуємо клас AppConfig, який використовується для налаштування додатку Django
from django.apps import AppConfig


# ============================================================
# Клас конфігурації додатку "main"
# ============================================================
class MainConfig(AppConfig):
    """
    Конфігурація додатку "main".
    Django використовує цей клас для реєстрації додатку та налаштувань.
    """

    # Поле default_auto_field визначає тип поля для автоматичного створення
    # первинного ключа у моделях цього додатку.
    # 'BigAutoField' — це 64-бітове ціле число, яке автоматично збільшується.
    default_auto_field = 'django.db.models.BigAutoField'

    # Ім'я додатку. Використовується Django для внутрішньої реєстрації.
    name = 'main'
