# news/apps.py

# ============================================================
# Імпорт класу AppConfig для налаштування додатку Django
# ============================================================
from django.apps import AppConfig

# ============================================================
# Клас конфігурації додатку "news"
# ============================================================
class NewsConfig(AppConfig):
    """
    Конфігурація додатку "news".
    Django використовує цей клас для реєстрації додатку
    та налаштувань його поведінки.
    """

    # Поле default_auto_field визначає тип первинного ключа для моделей
    # BigAutoField — 64-бітове ціле число, яке автоматично збільшується
    default_auto_field = 'django.db.models.BigAutoField'

    # Ім'я додатку. Має збігатися з назвою папки додатку
    name = 'news'
